In [2]:
import pandas as pd

In [ ]:
s = pd.Series([10000, 9000, 3000, 2000],
              index=["서울", "부산", "인천", "대전"])
s

In [ ]:
pd.Series(range(11, 14))

In [ ]:
s.index

In [ ]:
s.values

In [ ]:
s[3], s["대전"]

In [ ]:
s[["서울", "대전", "부산"]]

In [ ]:
for k, v in s.items():
    print("%s = %d" % (k, v))

In [ ]:
s2 = pd.Series({"서울": 12000, "부산": 9100, "인천": 3200, "이천": 1000})
s2

In [ ]:
ds = s - s2
ds

In [ ]:
ds[ds.notnull()]

In [3]:
import numpy as np
data = {
    "2015": np.random.randint(2000,10000,4),
    "2010": np.random.randint(2000,10000,4),
    "2005": np.random.randint(2000,10000,4),
    "2000": np.random.randint(2000,10000,4),
    "지역": ["수도권", "경상권", "수도권", "경상권"]
}
columns = ["지역", "2015", "2010", "2005", "2000"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역  2015  2010  2005  2000
서울  수도권  9334  5210  2463  5289
부산  경상권  4035  7951  7544  2876
인천  수도권  7947  6543  2994  5031
대구  경상권  6799  8623  6726  5213

In [4]:
df[["2010", "2015"]]

    2010  2015
서울  5210  9334
부산  7951  4035
인천  6543  7947
대구  8623  6799

In [ ]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

In [ ]:
df.T

In [ ]:
%%writefile sample1.csv
c1, c2, c3
1, 11.111, one
2, 22.222, two
3, 33.333, three

In [ ]:
pd.read_csv('sample1.csv')

In [ ]:
pd.read_csv('sample1.csv', index_col='c1')

In [ ]:
%%writefile sample3.txt
c1        c2        c3        c4
0.1 -1.5  1.3  0.4
1.2  0.8 -1.2  0.4
0.4 -2.0  0.2 -1.1

In [ ]:
pd.read_csv('sample3.txt', sep='\s+')

In [ ]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 11.11, one
2, 22.22, two
3, 33.33, three

In [ ]:
pd.read_csv('sample4.txt', skiprows=[0, 1])

In [ ]:
%%writefile sample5.csv
c1, c2, c3
1, 11.11, one
2, , two
누락, 33.33, three

In [ ]:
df = pd.read_csv('sample5.csv', na_values=['누락'])
df

In [ ]:
df.to_csv('sample6.csv')

In [ ]:
!cat sample6.csv  # 윈도우에서는 !type sample6.csv 명령을 사용

In [ ]:
df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data",sep='\s+',header=None)

In [ ]:
pd.set_option("display.max_rows", 20)  # 앞뒤로 모두 20행만 보여준다.
df

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.columns = ['CRIM','ZN','INDUS','CHAS','NOX','RM','AGE','DIS','RAD','TAX','PTRATIO','B1000','LSTAT','MEDV']

In [ ]:
df.loc[0, "CRIM"]

In [ ]:
df.loc[1:2, :]

In [ ]:
df.loc[df.ZN > 0, :]

In [ ]:
df.loc[0, :]

In [ ]:
df[:1]

In [ ]:
df.loc[0]

In [ ]:
df.iloc[0, ]

In [ ]:
df.iloc[2:3, 1:3]

In [ ]:
df.count()

In [ ]:
s = df.iloc[0,:]
s.count()

In [ ]:
s

In [ ]:
import numpy as np
s['CRIM'] = np.nan

In [ ]:
s.count()

In [ ]:

np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()
s2.value_counts()

In [ ]:
df['CHAS'].value_counts()

In [ ]:
s.sort_values()

In [ ]:
s.sort_values(ascending=False)

In [ ]:
df.sort_values(by=["ZN"])

In [ ]:
df.sum(axis=0)

In [ ]:
df.apply(lambda x: x.max() - x.min())

In [ ]:
df.apply(lambda x: x.max() - x.min(), axis=1)

In [ ]:
ages = [0, 1,3,10, 14, 20, 43, 32, 30, 62, 21, 51, 33, 90, 110]
bins = [1, 10, 20, 30, 60, 90]
labels = ["1살초과 10살이하", "20살이하", "30살이하", "60살이하", "90살이하"]
cats = pd.cut(ages, bins, labels=labels)
cats

In [ ]:
cats.codes

In [ ]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

In [ ]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

In [ ]:
pd.value_counts(cats)

In [ ]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003],
    '이름': ['프로도', '무지', '튜브']
}, columns=['고객번호', '이름'])
df1

In [ ]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005],
    '금액': [10000, 20000, 15000]
}, columns=['고객번호', '금액'])
df2

In [ ]:
pd.merge(df1, df2)

In [ ]:
pd.merge(df1, df2, how='outer')

In [ ]:
pd.merge(df1, df2, how='left')

In [ ]:
pd.merge(df1, df2, how='right')

In [ ]:
df2['이름'] = ['과자','라면','우유']

In [ ]:
pd.merge(df1, df2, on='고객번호') #left_on='고개번호', right_on="고객번호",  right_index=True, left_index=True

In [ ]:
df1.set_index('고객번호').join(df2.set_index('고객번호'),lsuffix='L',how='inner')

In [ ]:
pd.concat([df1,df2],axis=1)

In [3]:
data = {
    "이름": ["프로도", "무지", "프로도", "튜브", "무지", "튜브"],
    "연도": ["2015", "2010", "2005", "2015", "2005", "2005"],
    "소비": [1000, 2000, 1000, 3000, 1000, 11000],
    "품목": ["음식", "음식", "교통", "음식", "교통", "교통"]
}
columns = ["이름", "연도", "소비", "품목"]
df1 = pd.DataFrame(data, columns=columns)
df1

    이름    연도     소비  품목
0  프로도  2015   1000  음식
1   무지  2010   2000  음식
2  프로도  2005   1000  교통
3   튜브  2015   3000  음식
4   무지  2005   1000  교통
5   튜브  2005  11000  교통

In [4]:
df1.pivot("이름", "연도", "소비")

연도      2005    2010    2015
이름
무지    1000.0  2000.0     NaN
튜브   11000.0     NaN  3000.0
프로도   1000.0     NaN  1000.0

In [5]:
df1.groupby([df1.이름,'연도'])["소비"].sum()

이름   연도
무지   2005     1000
     2010     2000
튜브   2005    11000
     2015     3000
프로도  2005     1000
     2015     1000
Name: 소비, dtype: int64

In [6]:
df1.groupby('이름')['연도'].count()

이름
무지     2
튜브     2
프로도    2
Name: 연도, dtype: int64

In [7]:
df1.groupby('이름').size()

이름
무지     2
튜브     2
프로도    2
dtype: int64

In [8]:
df1.groupby('이름')['소비'].describe().T

이름              무지            튜브     프로도
count     2.000000      2.000000     2.0
mean   1500.000000   7000.000000  1000.0
std     707.106781   5656.854249     0.0
min    1000.000000   3000.000000  1000.0
25%    1250.000000   5000.000000  1000.0
50%    1500.000000   7000.000000  1000.0
75%    1750.000000   9000.000000  1000.0
max    2000.000000  11000.000000  1000.0